In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(
    {"a" : [4 ,5, 6],
    "b" : [7, 8, 9],
    "c" : [10, 11, 12]},
    index = pd.MultiIndex.from_tuples(
    [('d', 1), ('d', 2), ('e', 2)],
    names=['n', 'v']))

In [5]:
# df row에 대한 값 비교
df[df.a <= 5]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11

In [6]:
# df에 대한 값 비교
df[df['c'] > 11]

     a  b   c
n v
e 2  6  9  12

In [8]:
# 중복되는 값이 존재하는 df
df = pd.DataFrame(
    {"a" : [4 ,5, 6, 6],
    "b" : [7, 8, 9, 9],
    "c" : [10, 11, 12, 12]},
    index = pd.MultiIndex.from_tuples(
    [('d', 1), ('d', 2), ('e', 2), ('e', 3)],
    names=['n', 'v']))

In [9]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [10]:
# 중복되는 값들 지우기
df.drop_duplicates()
# 괄호 안에 inplace=True 하면 값 자체가 지워짐
#(아무것도 없으면 임의로 안 보이게 되는 것)

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [11]:
# 중복되는 값들 지우기
# keep을 이용해서 어느 위치에 있는 것을 표시할지 나타냄
df.drop_duplicates(keep='last')

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 3  6  9  12

In [14]:
# 값 비교 가능
df["b"] != 7

n  v
d  1    False
   2     True
e  2     True
   3     True
Name: b, dtype: bool